{
  "show" : true,
  "heading" : {
    "en" : "Projects",
    "de" : "Projekte" },

  "projects" : [ 

    { "key"       : "pencilhatching",
      "title"     : "Pencil Hatching App",
      "date"      : "2017-10-19",
      "ongoing"   : false,
     
      "caption"   : {
        "en" : "Pencil Hatching turns your photos into realistic pencil drawings. Many predefined presets help creating the right look.",
        "de" : "Pencil Hatching bietet die Möglichkeit, Fotos in realistische Bleistiftzeichungen zu verwandeln. Viele voreingestellte Presets helfen dabei, den richtigen Look zu erzielen." },

      "authors"   : [ "Tobias Dürschmid", "Matthias Trapp", "Sebastian Pasewaldt", "Amir Semmo" ],
      "thumbnail" : "/img/2017-pencilhatching.png",
      "downloads" : [
        { "href"  : "/pencilhatching.html",
          "desc"  : "Project Website"
        },
        { "href"  : "https://www.youtube.com/watch?v=cGFwQ4Xmhr0",
          "desc"  : "Video",
          "video" : "youtube"
        } ],
    },
    { "key"       : "sebook",
      "title"     : "SE Book",
      "date"      : "2025-09-10",
      "ongoing"   : true,
     
      "caption"   : {
        "en" : "Collection of Software Engineering concepts for teaching",
      },

      "authors"   : [ "Tobias Dürschmid"],
      "thumbnail" : "/img/se.png",
      "downloads" : [
        { "href"  : "/sebook.html",
          "desc"  : "Project Website"
        }
      ]
    },
    { "key"       : "prosumer",
      "title"     : "ProsumerFX",
      "date"      : "2017-10-10",
      "ongoing"   : false,
     
      "caption"   : {
        "en" : "The Prosumer app enables to create and share parameterizable image stylization effects on mobile devices.",
        "de" : "Die Prosumer ermöglicht es, parameterisierbare Bildeffekte auf mobilen Geräten zu erstellen und mit Freunden zu teilen." },

      "authors"   : [ "Tobias Dürschmid", "Matthias Trapp", "Sebastian Pasewaldt", "Amir Semmo" ],
      "thumbnail" : "/img/2017-prosumerFXapp.jpg",
      "downloads" : [
        { "href"  : "https://youtu.be/yv8N1tIce84",
          "desc"  : "Video",
          "video" : "youtube"
        } ],
    },
    { "key"       : "algernon",
      "title"     : "Algernon",
      "date"      : "2016-07-10",
      "ongoing"   : false,
     
      "caption"   : {
        "en" : "Algernon is a productivity tool for Squeak programmers; your personal assistant for Squeak. Algernon aims to make programming in Squeak faster and more keyboard centric. It provides lightning quick access to the core functionalities (classes, methods, morphs, tests, repositories ...) and even gives you a quick way to evaluate Smalltalk expressions.",
        "de" : "Algernon is a productivity tool for Squeak programmers; your personal assistant for Squeak. Algernon aims to make programming in Squeak faster and more keyboard centric. It provides lightning quick access to the core functionalities (classes, methods, morphs, tests, repositories ...) and even gives you a quick way to evaluate Smalltalk expressions." },

      "authors"   : [ "Ann Katrin Kuessner", "Jonathan Schneider",  "Louis Kirsch", "Pius Ladenburger", "Tobias Dürschmid" ],
      "thumbnail" : "/img/2016-algernon.png",
      "downloads" : [
        { "href"  : "https://github.com/HPI-SWA-Teaching/Algernon-Launcher",
          "desc"  : "Project"
        } ],
    },
    { "key"       : "tod",
      "title"     : "Trade-off-oriented Development",
      "date"      : "2019-01-01",
      "ongoing"   : false,
     
      "caption"   : {
        "en" : "Implementing a solution for a design decision that precisely satisfies the trade-off between quality attributes can be extremely challenging. Further, typically trade-offs are not represented as first-class entities in development artifacts. Hence, decisions might be suboptimal and lack requirements traceability as well as changeability. We propose Trade-off-oriented Development (ToD), a new concept to automate the selection and integration of reusable implementations for a given design decision based on quality attribute trade-offs. Implementations that vary in quality attributes and that solve reoccurring design decisions are collected in a design decision library. Developers declaratively specify the quality attribute trade-off, which is then used to automatically select the best fitting implementation. We argue that thereby, software satisfies the trade-offs more precisely, requirements are traceable and changeable, and advances in implementations automatically improve existing software."},
      "authors"   : [ "Tobias Dürschmid", "Eunsuk Kang", "David Garlan"],
      "thumbnail" : "/img/2019-nier.PNG",
      "downloads" : [
        { "href"  : "/TOD.html",
          "desc"  : "Project Website"
        } ],
    },
    { "key"       : "rosinfer",
      "title"     : "ROSInfer - Finding Architectural Bugs in ROS-based Robotics Systems",
      "date"      : "2023-10-10",
      "ongoing"   : true,
     
      "caption"   : {
        "en" : "Model-based analysis is a common technique to identify incorrect behavioral composition of complex, safety-critical systems, such as robotics systems. However, creating structural and behavioral models for hundreds of software components manually is often a labor-intensive and error-prone process. In this project, we present an approach to infer behavioral models for components of systems based on the Robot Operating System (ROS), the most popular framework for robotics systems, using static analysis by exploiting assumptions about the usage of the ROS framework. This work is a contribution towards making well-proven and powerful but infrequently used methods of model-based analysis more accessible and economical in practice to make robotics systems more reliable and safe."},
      "authors"   : [ "Tobias Dürschmid", "Christopher Timperley", "David Garlan", "Claire Le Goues"],
      "thumbnail" : "img/rosinfer.svg",
      "downloads" : [
        { "href"  : "/rosinfer.html",
          "desc"  : "Project Website"
        } ],
    },
    
     ]
}
